import { Link, NavLink } from "react-router-dom";
import "./companyStyle.scss";
import { useEffect, useMemo } from "react";

const Company = () => {
  useEffect(() => {
    document.title = "Компанія";
  }, []);

  const yearCompany = useMemo(() => {
    const timeCreate = new Date(1998, 9, 18).getTime();
    const timeNow = new Date().getTime();
    const year = Math.abs(new Date(timeCreate - timeNow).getFullYear() - 1970);
    return year;
  }, []);

  return (
    <>
      <div className="pages">
        <Link to="/">Головна</Link>
        <div>/</div>
        <NavLink to="/company">Компанія</NavLink>
      </div>

      <div className="company">
        <h1>Фірма “СЯЙВО-В”</h1>
        <div>
          <h4>Інформація про компанію:</h4>
          <div>
            Фірма “Сяйво-В” працює на ринку спецодягу з часу свого заснування в
            1998 році. Наша діяльність безпосередньо пов'язана з виробництвом
            великого асортименту спецодягу для працівників різних сфер
            діяльності. Ми виготовляємо спецодяг з натуральних та змішаних
            тканин, високу якість яких гарантують відомі провідні виробники
            України, Турції, Пакистану, Польщі, Голландії та інших країн.
            Головним критерієм є поєднання індивідуального пошиття з серійним
            виробництвом, відповідність одягу сучасним тенденціям, європейській
            якості, функціональності і корпоративному стилю підприємства та
            задоволення вимог найвибагливіших покупців. Нас відрізняє високий
            рівень сервісу, гручкі ціни та індивідуальний комплексний підхід до
            кожного клієнта.
          </div>
        </div>
        <div className="work">
          <h4>Наша робота:</h4>
          <div>
            <div>
              <span>1</span>{" "}
              <span>
                Виробництво спецодягу під замовлення та реалізація зі складу
                готового. Вишивка логотипу.
              </span>
            </div>
            <div>
              <span>2</span>{" "}
              <span>
                Реалізація взуття, засобів захисту від вітчизняного та
                зарубіжного виробника та супутніх товарів господарської групи.
              </span>
            </div>
          </div>
        </div>
        <hr />
        <div className="advantages">
          <h4>Переваги нашої компанії:</h4>
          <ol>
            <li>
              Досвід і надійність:{" "}
              <span>
                Ми на ринку вже {yearCompany} років, що свідчить про нашу
                стабільність та великий досвід у галузі.
              </span>
            </li>
            <li>
              Репутація:{" "}
              <span>
                Наша компанія має надійну репутацію, побудовану на чесності та
                відмінному обслуговуванні клієнтів.
              </span>
            </li>
            <li>
              Широкий асортимент:{" "}
              <span>
                Ми пропонуємо велику кількість товарів з різними ціновими
                категоріями, щоб задовольнити потреби різних клієнтів.
              </span>
            </li>
            <li>
              Висока якість товарів:{" "}
              <span>
                Наші товари відзначаються високою якістю, що гарантує
                задоволення наших клієнтів.
              </span>
            </li>
            <li>
              Компетентність співробітників:{" "}
              <span>
                Наші співробітники мають багатий досвід і високий рівень
                кваліфікації, завдяки чому ми можемо надавати професійну
                підтримку і консультації.
              </span>
            </li>
            <li>
              Інновації:{" "}
              <span>
                Ми завжди вдосконалюємо наші товари і послуги, щоб бути на
                передньому краї технологічних розробок і потреб споживачів.
              </span>
            </li>
            <li>
              Підтримка клієнтів:{" "}
              <span>
                Наша компанія завжди готова слухати потреби наших клієнтів і
                надавати їм індивідуальний підхід.
              </span>
            </li>
          </ol>
          <div>
            Завдяки цим перевагам ми є надійним і вигідним партнером для наших
            клієнтів.
          </div>
        </div>
        <div className="site-info">
          <h4>Переваги нашої компанії:</h4>
          <ol>
            <li>
              <span>Каталог:</span>{" "}
              <ul>
                <li>Опис і зображення продукції, представленої на сайті.</li>
              </ul>
            </li>
            <li>
              <span>Контакти:</span>{" "}
              <ul>
                <li>
                  Контактні дані компанії, включаючи адресу, телефон та
                  електронну пошту.
                </li>
                <li>Форму для зв'язку з питаннями або запитами.</li>
              </ul>
            </li>
            <li>
              <span>Розміри:</span>{" "}
              <ul>
                <li>Таблиці розмірів для взуття та одягу.</li>
                <li>Рекомендації щодо вибору правильного розміру.</li>
              </ul>
            </li>
            <li>
              <span>Прайс:</span>{" "}
              <ul>
                <li>
                  Інформацію про ціни на продукцію, представлену на сайті.
                </li>
                <li>Можливо, актуальні знижки та спеціальні пропозиції.</li>
              </ul>
            </li>
          </ol>
          <div>
            Эти страницы предоставляют пользователю полезную информацию о
            продукции, контактных данных компании, а также рекомендации по
            выбору размеров и информацию о ценах.
          </div>
        </div>
        <div className="additional">
          <h4>Додаткова інформація:</h4>
          <div>
            Разом з робочим одягом пропонуємо споживачам широкий асортимент
            робочого взуття та засобів індивідуального захисту різних цінових
            категорій. Запрошуємо до взаємовигідної співпраці вже існуючих та
            потенційних партнерів.
          </div>
        </div>
      </div>
    </>
  );
};

export default Company;
