import { Link, NavLink } from "react-router-dom";
import "./companyStyle.scss";

const Company = () => {
  return (
    <>
      <div className="pages">
        <Link to="/">Головна</Link>
        <div>/</div>
        <NavLink to="/company">Компанія</NavLink>
      </div>

      <div className="company">
        <h1>Фірма “СЯЙВО-В”</h1>
        <div>
          <h4>Наша робота:</h4>
          <div>
            -Виробництво спецодягу під замовлення та реалізація зі складу
            готового. Вишивка логотипу.
          </div>
          <div>
            -Реалізація взуття, засобів захисту від вітчизняного та зарубіжного
            виробника та супутніх товарів господарської групи.
          </div>
        </div>
        <div>
          <h4>Інформація про компанію:</h4>
          <div>
            Фірма “Сяйво-В” працює на ринку спецодягу з часу свого заснування в
            1998 році. Наша діяльність безпосередньо пов'язана з виробництвом
            великого асортименту спецодягу для працівників різних сфер
            діяльності. Ми виготовляємо спецодяг з натуральних та змішаних
            тканин, високу якість яких гарантують відомі провідні виробники
            України, Турції, Пакистану, Польщі, Голландії та інших країн.
            Головним критерієм є поєднання індивідуального пошиття з серійним
            виробництвом, відповідність одягу сучасним тенденціям, європейській
            якості, функціональності і корпоративному стилю підприємства та
            задоволення вимог найвибагливіших покупців. Нас відрізняє високий
            рівень сервісу, гручкі ціни та індивідуальний комплексний підхід до
            кожного клієнта.
          </div>
        </div>
        <div>
          <h4>Додаткова інформація:</h4>
          <div>
            Разом з робочим одягом пропонуємо споживачам широкий асортимент
            робочого взуття та засобів індивідуального захисту різних цінових
            категорій. Запрошуємо до взаємовигідної співпраці вже існуючих та
            потенційних партнерів.
          </div>
        </div>
      </div>
    </>
  );
};

export default Company;
