import { useEffect } from "react";
import { Link, NavLink } from "react-router-dom";
import "./priceStyle.scss";

const Price = () => {
  useEffect(() => {
    document.title = "Прайс";
  }, []);

  return (
    <>
      <div className="pages">
        <Link to="/">Головна</Link>
        <div>/</div>
        <NavLink to="/price">Прайс</NavLink>
      </div>

      <div className="category-price">
        <h3>Список категорій:</h3>
        <ol>
          <li>
            <a href="#table1">Костюм робочий</a>
          </li>
          <li>
            <a href="#table2">Напівкомбінезон з курткою</a>
          </li>
          <li>
            <a href="#table3">Одяг для зварника</a>
          </li>
          <li>
            <a href="#table4">Одяг камуфльований</a>
          </li>
          <li>
            <a href="#table5">Одяг охоронних структур</a>
          </li>
          <li>
            <a href="#table6">Теплий одяг</a>
          </li>
          <li>
            <a href="#table7">Головні убори</a>
          </li>
          <li>
            <a href="#table8">Халати. Фартухи. Костюми жіночі.</a>
          </li>
          <li>
            <a href="#table9">Захист від води. Плащі.</a>
          </li>
          <li>
            <a href="#table10">Одяг сигнальний</a>
          </li>
          <li>
            <a href="#table11">Господарча гігієна</a>
          </li>
          <li>
            <a href="#table12">Рукавиці</a>
          </li>
          <li>
            <a href="#table13">Перчатки</a>
          </li>
          <li>
            <a href="#table14">Взуття. Напівчеревики. Черевики.</a>
          </li>
          <li>
            <a href="#table15">Взуття. Чоботи.</a>
          </li>
          <li>
            <a href="#table16">Взуття. Чоботи гумові</a>
          </li>
          <li>
            <a href="#table17">Взуття. Валянки</a>
          </li>
          <li>
            <a href="#table18">Засоби захисту. Органи дихання</a>
          </li>
          <li>
            <a href="#table19">Засоби захисту. Окуляри. Щитки</a>
          </li>
          <li>
            <a href="#table20">Засоби захисту. Діелектрика</a>
          </li>
          <li>
            <a href="#table21">Засоби захисту. Голова</a>
          </li>
          <li>
            <a href="#table22">Засоби захисту. Навушники</a>
          </li>
          <li>
            <a href="#table23">Засоби захисту. Пояси страхувальні</a>
          </li>
          <li>
            <a href="#table24">Пожежна безпека</a>
          </li>
          <li>
            <a href="#table25">Господарська група</a>
          </li>
        </ol>
      </div>

      <div className="table-container">
        <h3>Таблиці цін:</h3>

        <div id="table1">
          <table>
            <thead>
              <tr>
                <th>Костюм робочий</th>
                <th>Ціна</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>
                  Костюм (куртка + штани) робочий Ки{" "}
                  <span>/тка-на пе75% бав25%/</span>
                </td>
                <td>600</td>
              </tr>
              <tr>
                <td>
                  Костюм (куртка + штани) робочий ЗД{" "}
                  <span>/тка-на пе70% бав30%/</span>
                </td>
                <td>715</td>
              </tr>
              <tr>
                <td>
                  Костюм (куртка + штани) робочий ЗД{" "}
                  <span>/тка-на пе65% бав35%/</span>
                </td>
                <td>810</td>
              </tr>
              <tr>
                <td>
                  Костюм (куртка + штани) ЗД <span>/тка-на бавовна 100%/</span>
                </td>
                <td>999</td>
              </tr>
              <tr>
                <td>
                  Костюм (куртка + штани) ЄК, ЄД <span>/тка-на грета/</span>
                </td>
                <td>810</td>
              </tr>
              <tr>
                <td>
                  Костюм (куртка + штани) ЄК, ЄД <span>/тка-на змішана/</span>
                </td>
                <td>900</td>
              </tr>
              <tr>
                <td>
                  Костюм (куртка + штани) ЄК. ЄД <span>/тка-на бавовна/</span>
                </td>
                <td>1080</td>
              </tr>
              <tr>
                <td>
                  Костюм з світловідбиваючою стрічкою <span>+30грн</span>
                </td>
                <td>+30</td>
              </tr>
              <tr>
                <td>Костюм сукняний (куртка + штани) кислотстійкий ХІМІК</td>
                <td>по замовл.</td>
              </tr>
              <tr>
                <td>
                  Костюм брезентовий (куртка + штани){" "}
                  <span>/брезент ОП щільність 550 г/м кв.</span>
                </td>
                <td></td>
              </tr>
              <tr>
                <td>
                  Костюм брезентовий ОП{" "}
                  <span>/брезент щільність 480 г/м кв./</span>
                </td>
                <td></td>
              </tr>
              <tr>
                <td>
                  Костюм Пекар <span>(Бязь)</span>
                </td>
                <td>405</td>
              </tr>
            </tbody>
          </table>
        </div>

        <div id="table2">
          <table>
            <thead>
              <tr>
                <th>Напівкомбінезон з курткою</th>
                <th>Ціна</th>
              </tr>
            </thead>
            <tbody>
              <tr>
                <td>
                  Напівкомбінезон з курткою Польща <span>(нортон)</span>
                </td>
                <td></td>
              </tr>
              <tr>
                <td>
                  Напівкомбінезон з курткою <span>(грета)</span>
                </td>
                <td>765</td>
              </tr>
              <tr>
                <td>
                  Напівкомбінезон з курткою (базова модель) (грета змішані
                  тканини)
                </td>
                <td>700</td>
              </tr>
              <tr>
                <td>
                  Напівкомбінезон з курткою (базова модель) (гарда-240г змішана
                  тканина) +відбиваюча стрічка
                </td>
                <td>720</td>
              </tr>
              <tr>
                <td>
                  Напівкомбінезон з курткою (базова модель) (саржа,
                  бавовна-100%)
                </td>
                <td>900</td>
              </tr>
              <tr>
                <td>
                  Напівкомбінезон з курткою з світлоповертаючою стрічкою в
                  залежності від тканини
                </td>
                <td>+30.00</td>
              </tr>
              <tr>
                <td>
                  Напівкомбінезон з курткою "Шляховик" (ортон, саржа зміш.) з
                  світлопов.стрічка
                </td>
                <td>990.00</td>
              </tr>
              <tr>
                <td>Напівкомбінезон (саржа бавовна 100%)</td>
                <td>510.00</td>
              </tr>
              <tr>
                <td>Напівкомбінезон (змішана)</td>
                <td>420,00</td>
              </tr>
              <tr>
                <td>Напівкомбінезон (грета)</td>
                <td>390.00</td>
              </tr>
            </tbody>
          </table>
        </div>
      </div>
    </>
  );
};

export default Price;
